tutorials/incompressible/nonNewtonianIcoFoam/offsetCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
left
{
    type patch;
    nFaces 35;
    startFace 3485;
}

right
{
    type patch;
    nFaces 35;
    startFace 3520;
}

down
{
    type wall;
    nFaces 40;
    startFace 3555;
}

up
{
    type wall;
    nFaces 40;
    startFace 3595;
}

cylinder
{
    type wall;
    nFaces 80;
    startFace 3635;
}

defaultFaces
{
    type empty;
    nFaces 3600;
    startFace 3715;
}
)

// ************************************************************************* //
